config/tsung/default.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<!-- Path should be correct -->
<tsung loglevel="info" version="1.0">
  <!-- Clients to generate load -->
  <clients>
    <!-- Must be hostname, can't be IP -->
    <client host="localhost" use_controller_vm="true" />
  </clients>

  <!-- Target servers -->
  <servers>
    <server host="localhost" port="4000" type="tcp"></server>
  </servers>

  <!-- Connections -->
  <load duration="2" unit="minute">
    <arrivalphase phase="1" duration="2" unit="minute">
      <users interarrival="1" unit="second"></users>
    </arrivalphase>

  </load>
  <!-- Sessions for a connection. Sum of all session's probabilities must be 100 -->
  <sessions>
    <session name="main" probability="100" type="ts_http">
      <transaction name="get_home">
        <request> <http url="/" method="GET"></http> </request>
      </transaction>
    </session>
  </sessions>
</tsung>